w-dee/esp-np2kai/hardware/bringup/esp32-p4/p4-nano/display/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# Keep the standalone diagnostic on the measured ESP32-P4 v1.x path.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# The board has a physical 16 MiB NOR Flash device.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# The offline test allocates its framebuffer from DMA-capable PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_USE_MALLOC=y

# Use the ordinary UART0 console and no secondary console.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Never access the physically disconnected panel by default.
CONFIG_P4_NANO_DISPLAY_RUN_HARDWARE_TEST=n
